{
  "welcome": "Welcome to my portfolio!",
  "firstName": "Pedro",
  "lastName": "Bonilla",
  "aka": "as well known as Pedro Bonilla",
  "jobTitle": "Full-Stack Developer",
  "description": "ABOUT ME",
  "about": [
    "I’m a <strong>Full-Stack Developer</strong> passionate about building <strong>intuitive, high-performance web applications</strong>. My expertise spans both <strong>frontend</strong> and <strong>backend</strong> development, allowing me to craft solutions that are as <strong>scalable</strong> as they are <strong>user-friendly</strong>.",
    "On the <strong>backend</strong>, I work with <strong>relational (MySQL) and non-relational (MongoDB) databases</strong>, designing efficient data structures and ensuring smooth data flow. On the <strong>frontend</strong>, I primarily develop with <strong>React</strong> and <strong>Vue</strong>, leveraging modern frameworks to create <strong>dynamic and maintainable user interfaces</strong>. While my personal portfolio is built with <strong>Astro</strong>, I’m always exploring new technologies to refine my workflow and optimize <strong>performance</strong>.",
    "I’ve developed <strong>web apps for EV charging stations, interactive geolocation maps, and event management platforms</strong>, as well as led <strong>redesigns and maintenance for educational websites</strong> and built <strong>custom WordPress solutions</strong> for industries like <strong>pharmaceuticals</strong> and <strong>the arts</strong>. Each project has deepened my understanding of <strong>usability, performance</strong>, and how to bridge <strong>technology with real-world impact</strong>.",
    "Beyond development, I have a deep appreciation for <strong>UX/UI design</strong>—while it’s not my main focus, I always prioritize <strong>usability, accessibility, and thoughtful interactions</strong> in my work.",
    "When I’m not coding, I’m usually playing football, gaming (both video games and board games), or reading. I thrive on <strong>problem-solving</strong>, whether it’s <strong>debugging</strong> a tricky piece of code or figuring out the best strategy in a game."
  ],
  "readMore": "Read More",
  "readLess": "Read Less",
  "results": "Results",
  "seeLink": "See Project",
  "projectsTitle": "PROJECTS",
  "projects": [
    {
      "title": "Taro Electrolinera",
      "description": "A mobile web application for charging electric vehicles at ultra-fast charging stations. Manages payments, session start and end, and records each charging session with its environmental impact.",
      "technologies": [
        "React",
        "TailwindCSS",
        "Stripe",
        "WebSocket",
        "NodeJS",
        "MongoDB",
        "Nodemailer"
      ],
      "year": 2024,
      "result": "Automated the entire ultra-fast charging cycle by integrating Stripe gateway and WebSockets in real time, avoiding customer waiting times. The OCPP connection allowed the user to interact directly with the charging station, giving him the real time consumption of his vehicle. The environmental impact was recorded at each charging session, allowing the user to see the impact of their electricity consumption.",
      "link": "https://www.electrotaro.com/",
      "image": "/projects/taroImage.png",
      "gradientFrom": "#00D29E",
      "gradientTo": "rgb(0 56 47)"

    },
    {
      "title": "Wise Canarias Talent Map",
      "description": "Interactive map highlighting female Canary Islands talent in STEAM fields, showcasing both local professionals and those who have emigrated.",
      "technologies": [
        "Leaflet",
        "Vue3",
        "MongoDB",
        "NodeJS",
        "Pinia",
        "TailwindCSS",
        "OpenStreetMap"
      ],
      "year": 2024,
      "result": "Visualised more than 300 STEAM profiles on an interactive map, with filters by discipline and geolocation. It succeeded in connecting professionals in mentoring processes. The local press echoed the project.",
      "link": "https://talentmap.wisecanarias.com/",
      "image": "/projects/talentImage.png",
     "gradientFrom": "#881bf5",
      "gradientTo": "#17e4ce"

    },
    {
      "title": "Evente",
      "description": "A web platform for publishing and managing events in the Canary Islands, connecting business owners seeking publicity with customers looking for events. Includes geolocation features.",
      "technologies": [
        "Nuxt",
        "MongoDB",
        "Stripe",
        "Google Cloud",
        "Geolocation"
      ],
      "year": "2024-2025",
      "result": "It centralised the supply of events in the Canary Islands: it simplified the promotion of events and improved the connections between organisers and attendees.",
      "link": "https://evente.netlify.app/",
      "image": "/projects/eventeImage.png",
      "gradientFrom": "#f15a24",
      "gradientTo": "#fbb03b"

    },
    {
      "title": "New Design and Integration of Reboot Academy Website",
      "description": "Redesign, development, and integration of the Reboot Academy website, aligned with the UX/UI team’s design vision.",
      "technologies": ["NextJS", "TailwindCSS"],
      "year": 2025,
      "result": "Reduced load times from 3.8 s ▶ 1.2 s (Lighthouse 99/100) with NextJS ISR and Tailwind. Implemented WCAG 2.2 accessible components, improving accessibility rating from 71 ▶ 95. 22% increase in organic leads in the first quarter post-release. In addition to a smooth implementation of the internationalisation of the website with i18n.",
      "link": "https://reboot.academy/",
      "image": "/projects/rebootImage.png",
      "gradientFrom": "#36E0D6",
      "gradientTo": "#36E0D6"

    },
    {
      "title": "Dimefarma de Canarias - Website",
      "description": "Digitalization project for a prestigious pharmaceutical distributor in the Canary Islands. The goal was to provide an easy-to-maintain tool without requiring programming knowledge.",
      "technologies": ["WordPress"],
      "year": 2025,
      "result": "It introduced a company, with more than 35 years of experience, to the digital world with a website that is easy to manage and maintain, without the need for prior technical knowledge.",
      "link": "https://dimefarma.org/",
      "image": "/projects/dimefarmaImage.png",
      "gradientFrom": "#3AA74E",
      "gradientTo": "#E20F21"

    },
    {
      "title": "Expresafest",
      "description": "A short film festival focused on raising awareness of social issues. Needed a user-friendly and attractive website for festival organization.",
      "technologies": ["WordPress"],
      "year": 2025,
      "result": "Created a user-friendly and visually appealing website for the festival, facilitating the organization and promotion of the event.",
      "link": "https://expresafest.com/",
      "image": "/projects/expresafestImage.png",
      "gradientFrom": "rgb(151, 120, 209)",
      "gradientTo": "rgb(51, 167, 181)"

    },
    {
      "title": "Landing Page for Edukami University",
      "description": "Landing page for Edukami University. It is a platform for online courses.",
      "technologies": ["HubSpot CMS", "HubL"],
      "year": 2025,
      "result": "A modern and responsive landing page that provides a clear overview of the courses offered by Edukami University, enhancing user engagement and course discovery.",
      "link": "https://university.edukami.ai/es",
      "image": "/projects/Edukami_UniversityImage.png",
      "gradientFrom": "rgb(151, 120, 209)",
      "gradientTo": "rgb(51, 167, 181)"
    },
    {
      "title": "Plugin for a GTIN scanning ERP",
      "description": "Plugin for a GTIN scanning ERP. Allows users to scan GTIN labels and obtain detailed information about the product while searching for the closest match in the database.",
      "technologies": ["PHP", "Bootstrap", "jQuery", "MySQL", "HTML", "CSS"],
      "year": 2025,
      "result": "Developed a plugin that enables users to scan GTIN labels and retrieve detailed product information, enhancing the efficiency of inventory management and product identification.",
      "link": "",
      "image": "/projects/Plugin-OCR.png",
      "gradientFrom": "#008F39",
      "gradientTo": "#0000FF"

    }
  ]
}
